

strings = [
    'Постройте график в декартовых координатах:',
    '$y = \\\\frac{2^x}{2^{x + 1} - 1}$',
    'Постройте график в декартовых координатах:',
    '$y = \\\\sqrt{1 + x^2}$',
    'Постройте график в декартовых координатах:',
    '$y = 2^\\\\frac{x + 1}{x}$',
    'Постройте график в полярных координатах:',
    '$r = 8\\\\sin(\\\\phi - \\\\frac{\\\\pi}{3})$',
    'Постройте график в полярных координатах:',
    '$r\\\\cos(\\\\phi - \\\\frac{\\\\pi}{4}) = -1$',
    'Постройте график в декартовых координатах:',
    '$y = \\\\log_3\\\\frac{x + 2}{x}$',
    'Постройте график в декартовых координатах:',
    '$y = \\\\sin(\\\\cos x)$',
    'Постройте график в полярных координатах:',
    '$r = e^\\\\phi$',
    'Докажите предел по определению:',
    '$\\\\lim\\\\limits_{n\\\\to+\\\\infty}\\\\frac{\\\\sqrt{3n + 1} + \\\\sqrt{3n - 1}}{\\\\sqrt{3n - 2}}=2$',
    'Докажите предел по определению:',
    '$\\\\lim\\\\limits_{n\\\\to+\\\\infty}\\\\frac{\\\\sqrt{\\\\sqrt{n} + n^2}}{n + \\\\sin{n}}=1$',
    'Докажите предел по определению:',
    '$\\\\lim\\\\limits_{n\\\\to+\\\\infty}\\\\sqrt{\\\\frac{4n + 1}{n - 1}}=2$',
    'Докажите предел по определению:',
    '$\\\\lim\\\\limits_{n \\\\to +\\\\infty} \\\\frac{\\\\sqrt[3]{n^3 + 1}}{n + 1} = 1$',
    'Докажите предел по определению:',
    '$\\\\lim\\\\limits_{n \\\\to +\\\\infty} (\\\\sqrt{n^2 + n} - n) = \\\\frac{1}{2}$',
    'Докажите предел по определению:',
    '$\\\\lim\\\\limits_{n \\\\to +\\\\infty} \\\\left(8 - \\\\frac{1}{n^2}\\\\right)^{-\\\\frac{1}{3}} = \\\\frac{1}{2}$',
    'Докажите предел по определению:',
    '$\\\\lim\\\\limits_{n \\\\to +\\\\infty} \\\\frac{2^{n + 2} + 3^{n + 3}}{2^n + 3^n} = 27$',
    'Докажите предел по определению:',
    '$\\\\lim\\\\limits_{n \\\\to +\\\\infty} \\\\frac{\\\\ln(n + 1)}{\\\\ln(n^2 + 1)} = \\\\frac{1}{2}$',
    'Докажите, что последовательность сходится:',
    '$x_n=\\\\sum_{k = 0}^{n}\\\\frac{k^2 + 1}{k!}$',
    'Докажите, что последовательность расходится:',
    '$x_n = \\\\sqrt[n]{((-1)^n - 1)^n + 1}$',
    'Докажите, что последовательность расходится:',
    '$x_n = \\\\sqrt{n!}$',
    'Докажите, что последовательность расходится:',
    '$x_n = \\\\sum_{k = 2}^n \\\\frac{1}{\\\\sqrt{k} \\\\ln k}$',
    'Докажите, что последовательность расходится:',
    '$x_n = \\\\frac{n \\\\cos\\\\pi n - 1}{2n}$',
    'Докажите, что последовательность сходится:',
    '$x_n = 0.77..7 \\\\text{($n$ семерок)}$',
    'Докажите, что последовательность сходится:',
    '$x_n = \\\\sum_{k = 1}^n \\\\frac{(-1)^k}{k}$',
    'Докажите, что последовательность расходится:',
    '$x_n = \\\\sum_{k = 1}^n \\\\frac{k^2}{(k^2 + 1)(k - 1)}$',
    'Вычислите предел функции:',
    '$\\\\lim\\\\limits_{x\\\\to 0} \\\\frac{10^x - 2^x}{\\\\tan x}$',
    'Вычислите предел функции:',
    '$\\\\lim\\\\limits_{x\\\\to 0} (e^x + x)^\\\\frac{1}{x}$',
    'Вычислите предел функции:',
    '$\\\\lim\\\\limits_{x\\\\to 0} (\\\\cos{x})^\\\\frac{1}{x^2}$',
    'Вычислите предел функции:',
    '$\\\\lim\\\\limits_{x \\\\to 0} \\\\frac{\\\\ln\\\\cos 5x}{\\\\ln\\\\cos 4x}$',
    'Вычислите предел функции:',
    '$\\\\lim\\\\limits_{x \\\\to \\\\infty} (\\\\sqrt{x^4 + x^2\\\\sqrt{x^4 + 1}} - \\\\sqrt{2x^4})$',
    'Вычислите предел функции:',
    '$\\\\lim\\\\limits_{x \\\\to 0} \\\\frac{\\\\ln(1 + 3x + x^2) + \\\\ln(1 - 3x + x^2)}{x^2}$',
    'Вычислите предел функции:',
    '$\\\\lim\\\\limits_{x \\\\to \\\\pi} \\\\frac{\\\\sin x}{\\\\pi^3 - x^3}$',
    'Вычислите предел функции:',
    '$\\\\lim\\\\limits_{x \\\\to 0} \\\\frac{e^{\\\\sin 5x} - e^{\\\\sin x}}{\\\\ln(1 + 2x)}$'
]

problem_number = [8, 8, 8, 8]

problems_written = 0
for n in range(4):
    print("p{} = ['".format(n + 1), end='')
    for i in range(problems_written, problems_written + problem_number[n] - 1):
        print(strings[2 * i], "\\\\tabularnewline\\n", strings[2 * i + 1], "\\\\tabularnewline\\n\\\\noalign{\\\\vskip4mm}\\n',", sep='')
        print("      '", end = '')
    i += 1
    print(strings[2 * i], "\\\\tabularnewline\\n", strings[2 * i + 1], "\\\\tabularnewline\\n\\\\noalign{\\\\vskip4mm}\\n']", sep='')
    print()
    problems_written += problem_number[n]
